//---------------------------------------------------------------------------
#ifndef HromatSoftIDH
#define HromatSoftIDH
//---------------------------------------------------------------------------
#include "SoftID.hpp"
#include <system.hpp>
//---------------------------------------------------------------------------
bool HromatSoftIDSetupDialog(HromatSoftID& destSoftId);
//---------------------------------------------------------------------------
// проверить мдентификатор встроенного ПО -
bool ValidateHromatInlineSoftId( HromatSoftID& id, bool isAdmin );


//---------------------------------------------------------------------------
#endif
//---------------------------------------------------------------------------
